performance/axis2/data/echoDoubles-50.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoDoubles xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input>0.0</ns1:input><ns1:input>1.0</ns1:input><ns1:input>2.0</ns1:input><ns1:input>3.0</ns1:input><ns1:input>4.0</ns1:input><ns1:input>5.0</ns1:input><ns1:input>6.0</ns1:input><ns1:input>7.0</ns1:input><ns1:input>8.0</ns1:input><ns1:input>9.0</ns1:input><ns1:input>10.0</ns1:input><ns1:input>11.0</ns1:input><ns1:input>12.0</ns1:input><ns1:input>13.0</ns1:input><ns1:input>14.0</ns1:input><ns1:input>15.0</ns1:input><ns1:input>16.0</ns1:input><ns1:input>17.0</ns1:input><ns1:input>18.0</ns1:input><ns1:input>19.0</ns1:input><ns1:input>20.0</ns1:input><ns1:input>21.0</ns1:input><ns1:input>22.0</ns1:input><ns1:input>23.0</ns1:input><ns1:input>24.0</ns1:input><ns1:input>25.0</ns1:input><ns1:input>26.0</ns1:input><ns1:input>27.0</ns1:input><ns1:input>28.0</ns1:input><ns1:input>29.0</ns1:input><ns1:input>30.0</ns1:input><ns1:input>31.0</ns1:input><ns1:input>32.0</ns1:input><ns1:input>33.0</ns1:input><ns1:input>34.0</ns1:input><ns1:input>35.0</ns1:input><ns1:input>36.0</ns1:input><ns1:input>37.0</ns1:input><ns1:input>38.0</ns1:input><ns1:input>39.0</ns1:input><ns1:input>40.0</ns1:input><ns1:input>41.0</ns1:input><ns1:input>42.0</ns1:input><ns1:input>43.0</ns1:input><ns1:input>44.0</ns1:input><ns1:input>45.0</ns1:input><ns1:input>46.0</ns1:input><ns1:input>47.0</ns1:input><ns1:input>48.0</ns1:input><ns1:input>49.0</ns1:input></ns1:echoDoubles></soapenv:Body></soapenv:Envelope>